import $ from 'jquery'; 

const data = [
	['УСЛУГИ','iPhone 4/4s','iPhone<br> 5/5c/5s/SE','iPhone 6','iPhone 6+','iPhone 6s','iPhone 6s+','iPhone 7','iPhone 7+','iPhone 8','iPhone 8+'],
	['Замена стекла<br> (оригинальное качество)','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена дисплея<br> (оригинальное качество)','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена дисплея <br> (копия ААА)','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена аккумулятора','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена контроллера питания','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена микросхемы U2','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена задней крышки','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена корпуса','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена разъёма зарядки','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена слухового динамика','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена полифонического динамика','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена микрофона','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена кнопки <br> "Home"(домой)','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена кнопки включения','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена датчика приближения','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена задней камеры','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена передней камеры','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена антенны','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена кнопок громкости','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена кнопки<br> переключения вибро','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена вибромотора','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена разъёма<br> наушников','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Замена аудиокодека','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Ремонт материнской платы','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Ремонт модуля Wi-Fi','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Обновление iOS','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Программный ремонт','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Снятие пароля<br> разблокировки','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Восстановление после<br> попадания влаги','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Установка защитного<br> стекла','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
	['Установка защитного<br> стекла 3D','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.','2000 руб.'],
];

const table = document.createElement('table');
// table.id = 'table';
const tbody = document.createElement('tbody');

const trList = _.map(data, (arr, indexRow) => {
    const tdList = _.map(arr, (val, indexCol) => (
        `<td rel='${indexRow}_${indexCol}'>${val}</td>`
    ));
    return `<tr>${tdList.join('')}</tr>`;
});

console.log(data[0]); 

tbody.innerHTML = trList.join('');
table.appendChild(tbody);
document.getElementById('root').appendChild(table);

const onHover = (rel) => {
    const [row, col] = rel.split('_');
    _.each(document.querySelectorAll('td'), (el)=>{
        const [rowEl, colEl] = el.getAttribute('rel').split('_');
        if (
            (parseFloat(rowEl) === parseFloat(row)
                && parseFloat(colEl) < parseFloat(col))
            || (parseFloat(rowEl) < parseFloat(row)
                && parseFloat(colEl) === parseFloat(col)) ) {
            el.classList.add('secondHover');
        }
    });
};
table.onmouseover = (ev) => {
    const target =  ev.target;
    if (target.tagName.toUpperCase() === 'TD') {
        // const dtStart = new Date();
        onHover(target.getAttribute('rel'));
        // console.log('TimeAdd', new Date() - dtStart);
    }
};
table.onmouseout = (ev) => {
    // const dtStartrm = new Date();
    const target =  ev.target;
    if (target.tagName.toUpperCase() === 'TD') {
        [].forEach.call(document.querySelectorAll('td'), (el) => {
            el.classList.remove('secondHover');
        });
    }
    // console.log('TimeRm', new Date() - dtStartrm);
};
